; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-8-8)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	truck8 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p0-1 - location
	p0-4 - location
	p1-2 - location
	p1-4 - location
	p2-3 - location
	p3-0 - location
	p3-1 - location
	p3-5 - location
	p5-0 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s0)
	(at driver3 s4)
	(at truck1 s0)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s4)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s4)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s4)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s4)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at truck6 s1)
	(empty truck6)
	(= (load truck6) 0)
	(= (fuel-per-minute truck6) 10)
	(at truck7 s3)
	(empty truck7)
	(= (load truck7) 0)
	(= (fuel-per-minute truck7) 10)
	(at truck8 s2)
	(empty truck8)
	(= (load truck8) 0)
	(= (fuel-per-minute truck8) 10)
	(at package1 s4)
	(at package2 s1)
	(at package3 s0)
	(at package4 s1)
	(at package5 s3)
	(at package6 s2)
	(at package7 s3)
	(at package8 s0)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 97)
	(= (time-to-drive s3 s0) 97)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 71)
	(= (time-to-drive s0 s1) 71)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 75)
	(= (time-to-drive s3 s1) 75)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 94)
	(= (time-to-drive s4 s1) 94)
	(link s1 s5)
	(link s5 s1)
	(= (time-to-drive s1 s5) 10)
	(= (time-to-drive s5 s1) 10)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 50)
	(= (time-to-drive s0 s2) 50)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 63)
	(= (time-to-drive s3 s2) 63)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 65)
	(= (time-to-drive s2 s4) 65)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 95)
	(= (time-to-drive s3 s4) 95)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 67)
	(= (time-to-drive s5 s4) 67)
	(link s5 s2)
	(link s2 s5)
	(= (time-to-drive s5 s2) 68)
	(= (time-to-drive s2 s5) 68)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 63)
	(= (time-to-drive s3 s5) 63)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s4)
	(at driver2 s3)
	(at driver3 s5)
	(at truck3 s0)
	(at truck5 s2)
	(at truck6 s3)
	(at package1 s4)
	(at package2 s2)
	(at package3 s3)
	(at package4 s1)
	(at package5 s5)
	(at package6 s4)
	(at package8 s4)
	))

(:metric minimize (+ (* 2 (total-time)) (* 1 (fuel-used))))

)

; plan
1. (board-truck driver2 truck1 s0)
   deleted: (at driver2 s0) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 2 of 13
2. (load-truck package3 truck1 s0)
   deleted: (at package3 s0)
   added: (in package3 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 2 of 13
3. (drive-truck truck1 s0 s3 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   changed: (fuel-used) from 0 to 1067
   goals met: 2 of 13
4. (unload-truck package3 truck1 s3)
   deleted: (in package3 truck1)
   added: (at package3 s3)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 3 of 13
5. (board-truck driver1 truck8 s2)
   deleted: (at driver1 s2) (empty truck8)
   added: (driving driver1 truck8)
   goals met: 3 of 13
6. (load-truck package6 truck8 s2)
   deleted: (at package6 s2)
   added: (in package6 truck8)
   changed: (load truck8) from 0 to 1, (fuel-per-minute truck8) from 10 to 11
   goals met: 3 of 13
7. (board-truck driver3 truck3 s4)
   deleted: (at driver3 s4) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 3 of 13
8. (drive-truck truck3 s4 s1 driver3)
   deleted: (at truck3 s4)
   added: (at truck3 s1)
   changed: (fuel-used) from 1067 to 2007
   goals met: 3 of 13
9. (drive-truck truck8 s2 s4 driver1)
   deleted: (at truck8 s2)
   added: (at truck8 s4)
   changed: (fuel-used) from 2007 to 2722
   goals met: 3 of 13
10. (load-truck package5 truck1 s3)
   deleted: (at package5 s3)
   added: (in package5 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 3 of 13
11. (load-truck package2 truck3 s1)
   deleted: (at package2 s1)
   added: (in package2 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 3 of 13
12. (disembark-truck driver1 truck8 s4)
   deleted: (driving driver1 truck8)
   added: (at driver1 s4) (empty truck8)
   goals met: 4 of 13
13. (drive-truck truck1 s3 s5 driver2)
   deleted: (at truck1 s3)
   added: (at truck1 s5)
   changed: (fuel-used) from 2722 to 3415
   goals met: 4 of 13
14. (unload-truck package5 truck1 s5)
   deleted: (in package5 truck1)
   added: (at package5 s5)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 5 of 13
15. (unload-truck package6 truck8 s4)
   deleted: (in package6 truck8)
   added: (at package6 s4)
   changed: (load truck8) from 1 to 0, (fuel-per-minute truck8) from 11 to 10
   goals met: 6 of 13
16. (drive-truck truck3 s1 s0 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   changed: (fuel-used) from 3415 to 4196
   goals met: 7 of 13
17. (drive-truck truck3 s0 s2 driver3)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   changed: (fuel-used) from 4196 to 4746
   goals met: 6 of 13
18. (unload-truck package2 truck3 s2)
   deleted: (in package2 truck3)
   added: (at package2 s2)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 7 of 13
19. (drive-truck truck1 s5 s3 driver2)
   deleted: (at truck1 s5)
   added: (at truck1 s3)
   changed: (fuel-used) from 4746 to 5376
   goals met: 7 of 13
20. (disembark-truck driver2 truck1 s3)
   deleted: (driving driver2 truck1)
   added: (at driver2 s3) (empty truck1)
   goals met: 8 of 13
21. (board-truck driver1 truck5 s4)
   deleted: (at driver1 s4) (empty truck5)
   added: (driving driver1 truck5)
   goals met: 7 of 13
22. (drive-truck truck5 s4 s2 driver1)
   deleted: (at truck5 s4)
   added: (at truck5 s2)
   changed: (fuel-used) from 5376 to 6026
   goals met: 8 of 13
23. (drive-truck truck3 s2 s5 driver3)
   deleted: (at truck3 s2)
   added: (at truck3 s5)
   changed: (fuel-used) from 6026 to 6706
   goals met: 8 of 13
24. (drive-truck truck3 s5 s1 driver3)
   deleted: (at truck3 s5)
   added: (at truck3 s1)
   changed: (fuel-used) from 6706 to 6806
   goals met: 8 of 13
25. (disembark-truck driver3 truck3 s1)
   deleted: (driving driver3 truck3)
   added: (at driver3 s1) (empty truck3)
   goals met: 8 of 13
26. (board-truck driver3 truck6 s1)
   deleted: (at driver3 s1) (empty truck6)
   added: (driving driver3 truck6)
   goals met: 8 of 13
27. (drive-truck truck6 s1 s3 driver3)
   deleted: (at truck6 s1)
   added: (at truck6 s3)
   changed: (fuel-used) from 6806 to 7556
   goals met: 9 of 13
28. (drive-truck truck5 s2 s0 driver1)
   deleted: (at truck5 s2)
   added: (at truck5 s0)
   changed: (fuel-used) from 7556 to 8056
   goals met: 8 of 13
29. (load-truck package8 truck5 s0)
   deleted: (at package8 s0)
   added: (in package8 truck5)
   changed: (load truck5) from 0 to 1, (fuel-per-minute truck5) from 10 to 11
   goals met: 8 of 13
30. (drive-truck truck5 s0 s2 driver1)
   deleted: (at truck5 s0)
   added: (at truck5 s2)
   changed: (fuel-used) from 8056 to 8606
   goals met: 9 of 13
31. (drive-truck truck6 s3 s1 driver3)
   deleted: (at truck6 s3)
   added: (at truck6 s1)
   changed: (fuel-used) from 8606 to 9356
   goals met: 8 of 13
32. (disembark-truck driver3 truck6 s1)
   deleted: (driving driver3 truck6)
   added: (at driver3 s1) (empty truck6)
   goals met: 8 of 13
33. (board-truck driver3 truck3 s1)
   deleted: (at driver3 s1) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 8 of 13
34. (drive-truck truck3 s1 s5 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s5)
   changed: (fuel-used) from 9356 to 9456
   goals met: 8 of 13
35. (walk driver2 s3 p3-1)
   deleted: (at driver2 s3)
   added: (at driver2 p3-1)
   goals met: 7 of 13
36. (walk driver2 p3-1 s1)
   deleted: (at driver2 p3-1)
   added: (at driver2 s1)
   goals met: 7 of 13
37. (board-truck driver2 truck6 s1)
   deleted: (at driver2 s1) (empty truck6)
   added: (driving driver2 truck6)
   goals met: 7 of 13
38. (drive-truck truck6 s1 s3 driver2)
   deleted: (at truck6 s1)
   added: (at truck6 s3)
   changed: (fuel-used) from 9456 to 10206
   goals met: 8 of 13
39. (drive-truck truck5 s2 s4 driver1)
   deleted: (at truck5 s2)
   added: (at truck5 s4)
   changed: (fuel-used) from 10206 to 10921
   goals met: 7 of 13
40. (drive-truck truck3 s5 s1 driver3)
   deleted: (at truck3 s5)
   added: (at truck3 s1)
   changed: (fuel-used) from 10921 to 11021
   goals met: 7 of 13
41. (drive-truck truck3 s1 s0 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   changed: (fuel-used) from 11021 to 11731
   goals met: 8 of 13
42. (drive-truck truck6 s3 s0 driver2)
   deleted: (at truck6 s3)
   added: (at truck6 s0)
   changed: (fuel-used) from 11731 to 12701
   goals met: 7 of 13
43. (disembark-truck driver1 truck5 s4)
   deleted: (driving driver1 truck5)
   added: (at driver1 s4) (empty truck5)
   goals met: 8 of 13
44. (disembark-truck driver2 truck6 s0)
   deleted: (driving driver2 truck6)
   added: (at driver2 s0) (empty truck6)
   goals met: 8 of 13
45. (board-truck driver1 truck5 s4)
   deleted: (at driver1 s4) (empty truck5)
   added: (driving driver1 truck5)
   goals met: 7 of 13
46. (drive-truck truck3 s0 s2 driver3)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   changed: (fuel-used) from 12701 to 13201
   goals met: 6 of 13
47. (unload-truck package8 truck5 s4)
   deleted: (in package8 truck5)
   added: (at package8 s4)
   changed: (load truck5) from 1 to 0, (fuel-per-minute truck5) from 11 to 10
   goals met: 7 of 13
48. (walk driver2 s0 p3-0)
   deleted: (at driver2 s0)
   added: (at driver2 p3-0)
   goals met: 7 of 13
49. (walk driver2 p3-0 s3)
   deleted: (at driver2 p3-0)
   added: (at driver2 s3)
   goals met: 8 of 13
50. (disembark-truck driver1 truck5 s4)
   deleted: (driving driver1 truck5)
   added: (at driver1 s4) (empty truck5)
   goals met: 9 of 13
51. (walk driver1 s4 p0-4)
   deleted: (at driver1 s4)
   added: (at driver1 p0-4)
   goals met: 8 of 13
52. (drive-truck truck3 s2 s5 driver3)
   deleted: (at truck3 s2)
   added: (at truck3 s5)
   changed: (fuel-used) from 13201 to 13881
   goals met: 8 of 13
53. (drive-truck truck3 s5 s1 driver3)
   deleted: (at truck3 s5)
   added: (at truck3 s1)
   changed: (fuel-used) from 13881 to 13981
   goals met: 8 of 13
54. (walk driver1 p0-4 s0)
   deleted: (at driver1 p0-4)
   added: (at driver1 s0)
   goals met: 8 of 13
55. (drive-truck truck3 s1 s0 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   changed: (fuel-used) from 13981 to 14691
   goals met: 9 of 13
56. (disembark-truck driver3 truck3 s0)
   deleted: (driving driver3 truck3)
   added: (at driver3 s0) (empty truck3)
   goals met: 9 of 13
57. (board-truck driver1 truck6 s0)
   deleted: (at driver1 s0) (empty truck6)
   added: (driving driver1 truck6)
   goals met: 9 of 13
58. (walk driver3 s0 p0-4)
   deleted: (at driver3 s0)
   added: (at driver3 p0-4)
   goals met: 9 of 13
59. (walk driver3 p0-4 s4)
   deleted: (at driver3 p0-4)
   added: (at driver3 s4)
   goals met: 9 of 13
60. (disembark-truck driver1 truck6 s0)
   deleted: (driving driver1 truck6)
   added: (at driver1 s0) (empty truck6)
   goals met: 9 of 13
61. (walk driver1 s0 p0-4)
   deleted: (at driver1 s0)
   added: (at driver1 p0-4)
   goals met: 9 of 13
62. (board-truck driver3 truck8 s4)
   deleted: (at driver3 s4) (empty truck8)
   added: (driving driver3 truck8)
   goals met: 9 of 13
63. (drive-truck truck8 s4 s5 driver3)
   deleted: (at truck8 s4)
   added: (at truck8 s5)
   changed: (fuel-used) from 14691 to 15361
   goals met: 9 of 13
64. (walk driver1 p0-4 s4)
   deleted: (at driver1 p0-4)
   added: (at driver1 s4)
   goals met: 10 of 13
65. (board-truck driver1 truck5 s4)
   deleted: (at driver1 s4) (empty truck5)
   added: (driving driver1 truck5)
   goals met: 9 of 13
66. (drive-truck truck5 s4 s2 driver1)
   deleted: (at truck5 s4)
   added: (at truck5 s2)
   changed: (fuel-used) from 15361 to 16011
   goals met: 10 of 13
67. (drive-truck truck5 s2 s0 driver1)
   deleted: (at truck5 s2)
   added: (at truck5 s0)
   changed: (fuel-used) from 16011 to 16511
   goals met: 9 of 13
68. (disembark-truck driver1 truck5 s0)
   deleted: (driving driver1 truck5)
   added: (at driver1 s0) (empty truck5)
   goals met: 9 of 13
69. (board-truck driver1 truck6 s0)
   deleted: (at driver1 s0) (empty truck6)
   added: (driving driver1 truck6)
   goals met: 9 of 13
70. (drive-truck truck6 s0 s3 driver1)
   deleted: (at truck6 s0)
   added: (at truck6 s3)
   changed: (fuel-used) from 16511 to 17481
   goals met: 10 of 13
71. (drive-truck truck6 s3 s4 driver1)
   deleted: (at truck6 s3)
   added: (at truck6 s4)
   changed: (fuel-used) from 17481 to 18431
   goals met: 9 of 13
72. (disembark-truck driver1 truck6 s4)
   deleted: (driving driver1 truck6)
   added: (at driver1 s4) (empty truck6)
   goals met: 10 of 13
73. (walk driver1 s4 p0-4)
   deleted: (at driver1 s4)
   added: (at driver1 p0-4)
   goals met: 9 of 13
74. (disembark-truck driver3 truck8 s5)
   deleted: (driving driver3 truck8)
   added: (at driver3 s5) (empty truck8)
   goals met: 10 of 13
75. (walk driver1 p0-4 s0)
   deleted: (at driver1 p0-4)
   added: (at driver1 s0)
   goals met: 10 of 13
76. (board-truck driver1 truck5 s0)
   deleted: (at driver1 s0) (empty truck5)
   added: (driving driver1 truck5)
   goals met: 10 of 13
77. (board-truck driver2 truck7 s3)
   deleted: (at driver2 s3) (empty truck7)
   added: (driving driver2 truck7)
   goals met: 9 of 13
78. (drive-truck truck7 s3 s4 driver2)
   deleted: (at truck7 s3)
   added: (at truck7 s4)
   changed: (fuel-used) from 18431 to 19381
   goals met: 9 of 13
79. (disembark-truck driver2 truck7 s4)
   deleted: (driving driver2 truck7)
   added: (at driver2 s4) (empty truck7)
   goals met: 9 of 13
80. (board-truck driver2 truck4 s4)
   deleted: (at driver2 s4) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 9 of 13
81. (disembark-truck driver1 truck5 s0)
   deleted: (driving driver1 truck5)
   added: (at driver1 s0) (empty truck5)
   goals met: 9 of 13
82. (drive-truck truck4 s4 s3 driver2)
   deleted: (at truck4 s4)
   added: (at truck4 s3)
   changed: (fuel-used) from 19381 to 20331
   goals met: 9 of 13
83. (walk driver1 s0 p0-4)
   deleted: (at driver1 s0)
   added: (at driver1 p0-4)
   goals met: 9 of 13
84. (walk driver1 p0-4 s4)
   deleted: (at driver1 p0-4)
   added: (at driver1 s4)
   goals met: 10 of 13
85. (board-truck driver1 truck6 s4)
   deleted: (at driver1 s4) (empty truck6)
   added: (driving driver1 truck6)
   goals met: 9 of 13
86. (drive-truck truck6 s4 s3 driver1)
   deleted: (at truck6 s4)
   added: (at truck6 s3)
   changed: (fuel-used) from 20331 to 21281
   goals met: 10 of 13
87. (drive-truck truck6 s3 s0 driver1)
   deleted: (at truck6 s3)
   added: (at truck6 s0)
   changed: (fuel-used) from 21281 to 22251
   goals met: 9 of 13
88. (drive-truck truck4 s3 s0 driver2)
   deleted: (at truck4 s3)
   added: (at truck4 s0)
   changed: (fuel-used) from 22251 to 23221
   goals met: 9 of 13
89. (disembark-truck driver2 truck4 s0)
   deleted: (driving driver2 truck4)
   added: (at driver2 s0) (empty truck4)
   goals met: 9 of 13
90. (walk driver2 s0 p3-0)
   deleted: (at driver2 s0)
   added: (at driver2 p3-0)
   goals met: 9 of 13
91. (walk driver2 p3-0 s3)
   deleted: (at driver2 p3-0)
   added: (at driver2 s3)
   goals met: 10 of 13
92. (disembark-truck driver1 truck6 s0)
   deleted: (driving driver1 truck6)
   added: (at driver1 s0) (empty truck6)
   goals met: 10 of 13
93. (walk driver1 s0 p0-4)
   deleted: (at driver1 s0)
   added: (at driver1 p0-4)
   goals met: 10 of 13
94. (walk driver1 p0-4 s4)
   deleted: (at driver1 p0-4)
   added: (at driver1 s4)
   goals met: 11 of 13
95. (walk driver3 s5 p5-0)
   deleted: (at driver3 s5)
   added: (at driver3 p5-0)
   goals met: 10 of 13
96. (walk driver3 p5-0 s0)
   deleted: (at driver3 p5-0)
   added: (at driver3 s0)
   goals met: 10 of 13
97. (board-truck driver3 truck5 s0)
   deleted: (at driver3 s0) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 10 of 13
98. (drive-truck truck5 s0 s2 driver3)
   deleted: (at truck5 s0)
   added: (at truck5 s2)
   changed: (fuel-used) from 23221 to 23721
   goals met: 11 of 13
99. (walk driver1 s4 p0-4)
   deleted: (at driver1 s4)
   added: (at driver1 p0-4)
   goals met: 10 of 13
100. (walk driver1 p0-4 s0)
   deleted: (at driver1 p0-4)
   added: (at driver1 s0)
   goals met: 10 of 13
101. (board-truck driver1 truck6 s0)
   deleted: (at driver1 s0) (empty truck6)
   added: (driving driver1 truck6)
   goals met: 10 of 13
102. (disembark-truck driver3 truck5 s2)
   deleted: (driving driver3 truck5)
   added: (at driver3 s2) (empty truck5)
   goals met: 10 of 13
103. (drive-truck truck6 s0 s3 driver1)
   deleted: (at truck6 s0)
   added: (at truck6 s3)
   changed: (fuel-used) from 23721 to 24691
   goals met: 11 of 13
104. (disembark-truck driver1 truck6 s3)
   deleted: (driving driver1 truck6)
   added: (at driver1 s3) (empty truck6)
   goals met: 11 of 13
105. (board-truck driver3 truck5 s2)
   deleted: (at driver3 s2) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 11 of 13
106. (drive-truck truck5 s2 s5 driver3)
   deleted: (at truck5 s2)
   added: (at truck5 s5)
   changed: (fuel-used) from 24691 to 25371
   goals met: 10 of 13
107. (disembark-truck driver3 truck5 s5)
   deleted: (driving driver3 truck5)
   added: (at driver3 s5) (empty truck5)
   goals met: 11 of 13
108. (board-truck driver2 truck1 s3)
   deleted: (at driver2 s3) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 10 of 13
109. (drive-truck truck1 s3 s4 driver2)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   changed: (fuel-used) from 25371 to 26321
   goals met: 10 of 13
110. (disembark-truck driver2 truck1 s4)
   deleted: (driving driver2 truck1)
   added: (at driver2 s4) (empty truck1)
   goals met: 10 of 13
111. (board-truck driver2 truck2 s4)
   deleted: (at driver2 s4) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 10 of 13
112. (drive-truck truck2 s4 s3 driver2)
   deleted: (at truck2 s4)
   added: (at truck2 s3)
   changed: (fuel-used) from 26321 to 27271
   goals met: 10 of 13
113. (board-truck driver3 truck5 s5)
   deleted: (at driver3 s5) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 9 of 13
114. (drive-truck truck5 s5 s3 driver3)
   deleted: (at truck5 s5)
   added: (at truck5 s3)
   changed: (fuel-used) from 27271 to 27901
   goals met: 9 of 13
115. (disembark-truck driver2 truck2 s3)
   deleted: (driving driver2 truck2)
   added: (at driver2 s3) (empty truck2)
   goals met: 10 of 13
116. (disembark-truck driver3 truck5 s3)
   deleted: (driving driver3 truck5)
   added: (at driver3 s3) (empty truck5)
   goals met: 10 of 13
117. (board-truck driver3 truck6 s3)
   deleted: (at driver3 s3) (empty truck6)
   added: (driving driver3 truck6)
   goals met: 10 of 13
118. (drive-truck truck6 s3 s5 driver3)
   deleted: (at truck6 s3)
   added: (at truck6 s5)
   changed: (fuel-used) from 27901 to 28531
   goals met: 9 of 13
119. (board-truck driver2 truck5 s3)
   deleted: (at driver2 s3) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 8 of 13
120. (disembark-truck driver3 truck6 s5)
   deleted: (driving driver3 truck6)
   added: (at driver3 s5) (empty truck6)
   goals met: 9 of 13
121. (drive-truck truck5 s3 s2 driver2)
   deleted: (at truck5 s3)
   added: (at truck5 s2)
   changed: (fuel-used) from 28531 to 29161
   goals met: 10 of 13
122. (disembark-truck driver2 truck5 s2)
   deleted: (driving driver2 truck5)
   added: (at driver2 s2) (empty truck5)
   goals met: 10 of 13
123. (walk driver2 s2 p2-3)
   deleted: (at driver2 s2)
   added: (at driver2 p2-3)
   goals met: 10 of 13
124. (walk driver2 p2-3 s3)
   deleted: (at driver2 p2-3)
   added: (at driver2 s3)
   goals met: 11 of 13
125. (board-truck driver3 truck6 s5)
   deleted: (at driver3 s5) (empty truck6)
   added: (driving driver3 truck6)
   goals met: 10 of 13
126. (drive-truck truck6 s5 s3 driver3)
   deleted: (at truck6 s5)
   added: (at truck6 s3)
   changed: (fuel-used) from 29161 to 29791
   goals met: 11 of 13
127. (disembark-truck driver3 truck6 s3)
   deleted: (driving driver3 truck6)
   added: (at driver3 s3) (empty truck6)
   goals met: 11 of 13
128. (board-truck driver1 truck2 s3)
   deleted: (at driver1 s3) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 11 of 13
129. (drive-truck truck2 s3 s4 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s4)
   changed: (fuel-used) from 29791 to 30741
   goals met: 11 of 13
130. (disembark-truck driver1 truck2 s4)
   deleted: (driving driver1 truck2)
   added: (at driver1 s4) (empty truck2)
   goals met: 12 of 13
131. (walk driver3 s3 p3-5)
   deleted: (at driver3 s3)
   added: (at driver3 p3-5)
   goals met: 12 of 13
132. (walk driver3 p3-5 s5)
   deleted: (at driver3 p3-5)
   added: (at driver3 s5)
   goals met: 13 of 13
